Revit 2024 API
DetailCurveArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Insert(
	DetailCurve item,
	int index
)
Visual Basic
Public Overridable Sub Insert ( _
	item As DetailCurve, _
	index As Integer _
)
Visual C++
public:
virtual void Insert(
	DetailCurve^ item,
	int index
)
Parameters
item
Type: Autodesk.Revit.DB.DetailCurve
index
Type: System.Int32
See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace